app/controllers/home_controller.rb

  def line_chart
    @data = Widget.all
    @series = @data.map{|w| w.widget_stats}
---
SELECT * FROM "widgets"
SELECT * FROM "widget_stats" WHERE ("widget_stats".widget_id = 1)